class Rubber {
  final String title;
  final String urlImage;
  final String subtitle;
  final String namerubber;

  const Rubber({
    required this.title,
    required this.urlImage,
    required this.subtitle,
    required this.namerubber,
  });
}

List<Rubber> allRubbers = [
  Rubber(
    title: 'โรคที่เกิดจากเชื้อคอลเลตโตริกัม',
    urlImage: 'assets/07.png',
    subtitle: '(Colletotrichum Leaf Disease)',
    namerubber: ''' ที่มา : กรมวิชาการเกษตร

เชื้อสาเหตุ เชื้อรา Colletotrichum gloeosporioides (Gloeosporium alborubrum) และ Colletotrichum heveae

ลักษณะอาการของโรค
        ถ้าเกิดจากเชื้อ C.gloeosporioides เชื้อนี้เข้าทำลายใบยางขณะมีอายุ 5 - 15 วัน หลังจากเริ่มผลิ คือ ระยะที่ใบขยายและกำลังเปลี่ยนจากสีทองแดงเป็นเขียวอ่อน เมื่อเชื้อราเข้าทำลายอย่างรุนแรง ใบจะเหี่ยวและหลุดร่วงทันที แต่ถ้าหากเชื้อราเข้าทำลายเมื่อใบโตเต็มที่แล้ว ใบจะแสดงอาการเป็นจุด ปลายใบหงิกงอ แผ่นใบเป็นจุดสีน้ำตาล มีขอบแผลสีเหลือง เมื่อใบมีอายุมากขึ้นจุดเหล่านี้จะนูนจนสังเกตเห็นได้ชัด

        ถ้าเกิดจากเชื้อ C.heveae ระยะเริ่มแรกของโรคนี้จะมีแผลเป็นจุดสีน้ำตาลขนาดเล็กค่อนข้างกลม ขอบแผลมีสีน้ำตาลเข้ม แล้วขยายออกจนกลายเป็นแผลใหญ่ขึ้น ซึ่งแผลของโรคนี้จะใหญ่กว่าโรคที่เกิดจาก C. gloeosporioides ตรงกลางแผลจะเกิดจุดสีดำของราเป็นคล้ายขนแข็ง ๆ ยื่นขึ้นมาจากผิวใบ โรคนี้มักเกิดกับต้นยางที่ปลูกในดินที่ขาดความอุดมสมบูรณ์

สภาพแวดล้อมที่เหมาะสม และการแพร่กระจายของโรค

        เชื้อนี้จะแพร่กระจายในระยะฝนชุก และเข้าทำลายส่วนยอดหรือกิ่งอ่อนที่ยังเป็น สีเขียวอยู่ ซึ่งจะเห็นเป็นรอยแตกบนเปลือก โดยแผลมีลักษณะกลมคล้ายฝาชีที่ยอดขาดแหว่งไป หรือมีรูปร่างยาวรีไปตามเปลือกก็ได้ ถ้าเป็นมากยอดนั้น ๆ จะแห้งตาย หากอากาศแห้งแล้งในระยะต่อมาจะทำให้ต้นยางเล็กแห้งตายได้

การป้องกันกำจัด

        1. เนื่องจากโรคนี้เกิดกับยางที่ไม่สมบูรณ์ การบำรุงรักษาสภาพดินให้เหมาะแก่การเจริญเติบโตของต้นยาง จึงเป็นวิธีป้องกันที่ดีที่สุด
        2. ป้องกันใบที่ผลิออกมาใหม่มิให้เป็นโรค โดยใช้สารเคมี ไซเน็บ หรือแคบตาโฟล ผสมสารจับใบฉีดพ่น 5 - 6 ครั้ง ในระยะที่ใบอ่อนกำลังขยายตัวจนมีขนาดโตเต็มที่''',
  ),
  Rubber(
      title: 'โรคเปลือกเน่า',
      urlImage: 'assets/08.png',
      subtitle: '(Mouldy rot)',
      namerubber: '''ที่มา : กรมวิชาการเกษตร

เชื้อสาเหตุเชื้อรา Ceratocystis fimbriata

ลักษณะอาการของโรค

        ในระยะแรกจะเห็นเป็นรอยบุ๋ม และมีสีจางบนเปลือกงอกใหม่เหนือรอยกรีด ซึ่งเป็นลักษณะอาการที่คล้ายคลึงกับอาการระยะแรกของโรคเส้นดำ ในระยะต่อมารอยแผลของโรคเปลือกเน่าจะมีเส้นใยของเชื้อราสีเทาขึ้นปกคลุมจนเห็นได้ชัด เมื่ออาการของโรครุนแรงขึ้นและสภาพแวดล้อมเหมาะแก่การเจริญเติบโตของเชื้อรา จะสังเกตเห็นเชื้อราเจริญและขยายลุกลามออกไปจนเห็นเส้นใยของเชื้อราเกิดขึ้นเป็นแถบขนานไปกับรอยกรีด ซึ่งเปลือกบริเวณดังกล่าวนี้จะเน่าหลุดเป็นแอ่งเหลือแต่เนื้อไม้สีดำในที่สุด เมื่อเฉือนเปลือกบริเวณข้างเคียงรอยแผลออกดูจะไม่พบอาการเน่าลุกลามออกไปแต่อย่างใด

สภาพแวดล้อมที่เหมาะสมต่อการเกิดโรค

        บริเวณที่สภาพอากาศมีความชุ่มชื้นอยู่ตลอดเวลา

การแพร่ระบาด

        เชื้อนี้สามารถแพร่กระจายไปยังต้นข้างเคียงได้โดยอาศัยลม แมลง เป็นพาหะ

การป้องกันกำจัด

        1. เนื่องจากโรคนี้มักเกิดในแหล่งปลูกยางที่มีความชื้นสูงมาก ๆ ฉะนั้นในแปลงยางจึงควรมีการตัดแต่งกิ่งและกำจัดวัชพืชในสวนยางอยู่เป็นประจำ เพื่อให้สวนยางโปร่งมีอากาศถ่ายเทได้สะดวก ความชื้นในแปลงยางจะได้ลดลง
        2. ถ้าปรากฏว่าต้นยางเป็นโรคเปลือกเน่า ควรหยุดกรีดยางเสีย 2 - 3 สัปดาห์ เพื่อป้องกันมิให้เชื้อแพร่ไปติดต้นอื่น
        3. โรคนี้นอกจากจะติดไปยังต้นอื่นได้ด้วยลมและแมลงแล้ว ยังอาจติดไปกับเสื้อผ้าของคนกรีด ภาชนะที่ใส่เศษยาง และมีดกรีดยางอีกด้วย ถ้าปรากฏว่าในสวนยางเป็นโรคนี้แล้วจะต้องควบคุมระมัดระวังสิ่งเหล่านี้ด้วยเช่นกัน
        4. การใช้สารเคมีป้องกันกำจัดโรคเส้นดำก็จะสามารถป้องกันโรคเปลือกเน่าได้
        5. ในกรณีที่พบมอดหรือแมลงชนิดอื่นเจาะเปลือกยางที่เป็นโรคนี้ให้ใช้ยาฆ่าแมลงกำจัดแมลงเหล่านั้นเสีย
        6. เมื่อพบต้นยางเป็นโรคเปลือกเน่าให้ใช้สารไธอาเบนดาโซล อัตรา 20 กรัม (ประมาณ 2 ช้อนแกง) ต่อน้ำ 1 ลิตร ผสมสารแผ่กระจายและจับติด 2 ซีซี. (ประมาณ 1/2 ช้อนชา) หรือสาร ออกซาดิกซิล แมนโคเซ็บ อัตรา 40 กรัม (ประมาณ 4 ช้อนแกง) ต่อน้ำ 1 ลิตร ผสมสารแผ่กระจายและจับติด 2 ซีซี. (ประมาณ 1/2 ช้อนชา) อย่างใดอย่างหนึ่งทาหน้ากรีดยางทุก 7 วัน 3 - 4 ครั้ง จะสามารถป้องกันกำจัดโรคนี้ได้ แต่ถ้าหากฝนตกชุก โรคอาจเกิดขึ้นมาใหม่ ให้ทาสารเคมีดังกล่าวซ้ำต่อไปจนกว่าโรคจะหาย
'''), //
  Rubber(
      title: 'โรคเปลือกแห้ง',
      urlImage: 'assets/09.png',
      subtitle: '(dry bark disease)',
      namerubber: '''ที่มา : กรมวิชาการเกษตร

สาเหตุ
        - สวนยางขาดการบำรุงรักษา
        - การใส่ปุ๋ยไม่ตรงกับเวลาที่กำหนด และใช้ปุ๋ยไม่เหมาะสมกับสภาพของดิน
        - กรีดเอาน้ำยางออกมากเกินไป กรีดถี่เกินไป และใช้ระบบกรีดไม่ถูกต้อง
        - เกิดการผิดปกติภายในท่อน้ำยาง

ลักษณะอาการของโรค

        ก่อนเกิดโรค ต้นยางที่จะเป็นโรคเปลือกแห้ง มักจะแสดงอาการอย่างใดอย่างหนึ่ง หรือหลายอย่างประกอบกันให้สังเกตเห็นได้ ดังนี้
             1. น้ำยางบนรอยกรีดจะจับตัวกันเร็วกว่าปกติ
             2. น้ำยางที่กรีดได้จะมีปริมาณมากกว่าปกติ การหยดของน้ำยางนานกว่าปกติ
             3. น้ำยางที่กรีดได้จะใส และมีปริมาณเนื้อยางแห้งต่ำ
             4. เปลือกของต้นยางเหนือรอยกรีดจะมีสีซีดลง

        ขณะเป็นโรค ต้นยางเปลือกจะแห้ง กรีดแล้วไม่มีน้ำยางไหล เปลือกต้นยางตามลำต้นจะแตก พุพอง แต่ต้นยางไม่ตาย ถ้าปล่อยปละไม่ควบคุม จะแพร่กระจายลุกลาม ทำให้หน้ากรีดของยางต้นนั้นเสียหายทั้งหมด (ไม่แพร่ระบาดไปสู่ต้นอื่น) การ ลุกลามของโรคมีหลายลักษณะดังนี้

        1. โรคนี้ส่วนใหญ่จะลุกลามไปทางด้านซ้ายมือเสมอ
        2. เกิดโรคนี้แล้วไม่มีการดูแลรักษา โรคจะลุกลามไปยังหน้ากรีดที่อยู่ติดกัน
        3. การลุกลามของโรคบนหน้ากรีด ถ้ากรีดจากบนลงล่างโรคก็จะลุกลามจากบนลงล่าง ถ้ากรีดจากล่างขึ้นบนโรคก็จะลุกลามจากล่างขึ้นบน
        4. อาการเปลือกแห้งจะไม่ลุกลามจากเปลือกที่ยังไม่ทำการกรีดไปยังเปลือกงอกใหม่ และไม่ลุกลามจากเปลือกงอกใหม่ด้านหนึ่งไปยังอีกด้านหนึ่ง
        5. ถ้าเป็นโรคเปลือกแห้งชนิดที่เกิดขึ้นอย่างรวดเร็ว ภายใน 2 - 3 เดือน หน้ากรีดของต้นยางจะเป็นโรคเปลือกแห้งทั้งหมด

การป้องกันกำจัด

        1. เอาใจใส่บำรุงรักษาสวนยางให้สมบูรณ์แข็งแรงตั้งแต่เริ่มปลูก
        2. ใส่ปุ๋ยที่เหมาะสมตามจำนวนและระยะเวลาที่ทางวิชาการแนะนำ
        3. ใช้ระบบกรีดให้ถูกต้องและเหมาะสมกับพันธุ์ยาง
        4. อย่ากรีดยางเมื่อยางยังไม่ได้ขนาดเปิดกรีด
        5. หยุดกรีดยางในขณะยางผลัดใบ

ยางที่จะเปิดกรีดใหม่

        - สำหรับยางที่เริ่มเปิดกรีดใหม่ ก่อนเปิดกรีด 3 เดือน ควรทำร่องแยกหน้ากรีดออกจากกัน ในการทำร่องให้ใช้สิ่วเซาะเป็นร่องลึกจนถึงเนื้อไม้ โดยทำร่องเดียวตรงตลอดจากจุดที่จะเปิดกรีดด้านบนจนถึงส่วนโคนของต้นยาง
        - ทำร่องบริเวณโคนต้นยางให้ร่องนี้ขวางกับลำต้น โดยให้ร่องจดกับร่องที่ทำแบ่งแยกหน้ากรีด เพื่อป้องกันมิให้โรคลุกลามลงสู่ราก
        - เปิดกรีดเมื่อต้นยางได้ขนาดและกรีดตามระบบที่เหมาะสมกับพันธุ์ยาง

ยางที่เปิดกรีดแล้วและเป็นโรคเปลือกแห้งเพียงบางส่วน

        - หากต้นยางแสดงอาการเปลือกแห้งเพียงบางส่วน ถ้าไม่ควบคุมโรคจะลุกลามออกไป ทำให้หน้ากรีดเสียหายทั้งหมด
        - ควบคุมโดยทำร่องแยกส่วนที่เป็นโรคออกจากกัน วิธีทำร่องใช้สิ่วเซาะร่องให้ลึกถึงเนื้อไม้รอบบริเวณที่เป็นโรค ห่างจากบริเวณที่เป็นโรคประมาณ 2 ซม.
        - หลังจากทำร่องเรียบร้อยแล้ว ก็สามารถเปิดกรีดต่อไปได้ตามปกติ แต่ต้องเปิดกรีดต่ำกว่าบริเวณที่เป็นโรค'''), //
  Rubber(
      title: 'โรคเส้นดำ',
      urlImage: 'assets/10.png',
      subtitle: '(Black Stripe)',
      namerubber: '''ที่มา : กรมวิชาการเกษตร

เชื้อสาเหตุเชื้อรา Phytophthora palmivora และ Phytophthora botryosa

ลักษณะอาการของโรค
        เชื้อจะเข้าทำลายได้เฉพาะบริเวณเปลือกยางที่มีบาดแผลเท่านั้น โดย ส่วนใหญ่จะเข้าทำลายทันทีทางรอยกรีดใหม่ที่กรีดไปแล้วไม่เกิน 24 ชั่วโมง บนผิวเปลือกยางที่ไม่มีบาดแผลใด ๆ เชื้อสาเหตุของโรคนี้จะไม่สามารถเข้าทำลายต้นยางได้ ฉะนั้นการกรีดยางให้ดีและถูกต้องจึงมีความสำคัญมาก

        ในระยะแรกหลังจากที่เชื้อราเข้าทำลายแล้ว จะเห็นบริเวณที่เป็นโรคมีสีผิดปกติเป็นรอยช้ำ ส่วนมากมักจะเกิดขึ้นเหนือรอยกรีด หากอาการรุนแรงมากขึ้นบริเวณที่เป็นรอยช้ำนี้จะเปลี่ยนเป็นรอยบุ๋มสีดำ และจะขยายตัวยาวขึ้นไปในแนวดิ่ง คือสูงขึ้นไปส่วนบนเหนือรอยกรีดและลงใต้รอยกรีดอย่างรวดเร็ว ระยะนี้จะสังเกตเห็นอาการของโรคได้ชัดเจน เนื่องจากส่วนที่ไม่เป็นโรคมีเปลือกงอกใหม่หนาเพิ่มมากขึ้น ทิ้งให้ส่วนที่เป็นโรคเป็นรอยบุ๋มลึกชัดเจน เนื่องจากเยื่อเจริญส่วนนั้นตายหมด เมื่อเฉือนเปลือกออกดูจะพบรอยบุ๋มสีดำนั้นมีลายเส้นสีดำ บนเนื้อไม้บริเวณแผล ซึ่งมักเป็นรอยยาวตามแนวยืนของลำต้น อาการขั้นรุนแรงจะทำให้เปลือกของหน้ายางบริเวณที่เป็นโรคปริ มีน้ำยางไหลออกมาตลอดเวลา และเปลือกบริเวณที่เป็นโรคนี้จะเน่าหลุดออกทั้งหมดในที่สุด ยางพันธุ์ที่อ่อนแอต่อโรคนี้ได้แก่ RRIM600

สภาพแวดล้อมที่เหมาะสมต่อการเกิดโรค

        ความชื้น ปริมาณน้ำฝน และจำนวนวันฝนตก เป็นปัจจัยที่สำคัญที่จะสนับสนุนให้เชื้อรานี้ระบาดรุนแรง

การแพร่ระบาด

        เชื้อจะเข้าทำลายได้เฉพาะบริเวณเปลือกยางที่มีบาดแผลเท่านั้น ส่วนใหญ่จะเข้าทำลายทันที ทางรอยกรีดใหม่ที่กรีดไปแล้วไม่เกิน 24 ชั่วโมง โรคนี้แพร่ระบาดอย่างกว้างขวางในพื้นที่ปลูกยางทั่วไปโดยเฉพาะในเขตที่เกิดโรคใบร่วง และผลเน่าระบาดเป็นประจำทุกปี เช่นในเขตภาคใต้ฝั่งตะวันตก

การป้องกันกำจัด

        1. อย่าเปิดหน้ายางหรือขึ้นหน้ายางใหม่ในระหว่างฤดูฝน โดยเฉพาะอย่างยิ่งในช่วงที่มีฝนตก อย่ากรีดลึกจนถึงเนื้อไม้ เพราะจะทำให้หน้ายางเสียหายและเป็นผลทำให้โอกาสที่เชื้อจะเข้าทำลายมีมาก
        2. ตัดแต่งกิ่งยางและปราบวัชพืชในสวนยางให้สวนยางโปร่ง มีอากาศถ่ายเทสะดวก จะช่วยให้หน้ายางแห้งเร็วขึ้น เป็นการลดความรุนแรงของโรคได้
        3. การกรีดยางในฤดูฝนโดยเฉพาะอย่างยิ่งในระยะที่มีโรคใบร่วงระบาด ควรทาหน้ายางด้วยสารเคมีชนิดเดียวกับที่ใช้รักษา
        4. เมื่อพบหน้ากรีดยางเริ่มแสดงอาการ ให้ใช้สารเมตาแลคซิล อัตรา 7 - 14 กรัม (ประมาณ 1 ช้อนชาครึ่ง) ต่อน้ำ 1 ลิตร หรือสารออกซาเดียซิล แมนโคเซ็บ อัตรา 40 กรัม (ประมาณ 4 ช้อนแกง) ต่อน้ำ 1 ลิตร ผสมสารแผ่กระจายและจับติด จำนวน 2 ซีซี (ประมาณ 1/2 ช้อนชา) ใช้สารอย่างใดอย่างหนึ่งทาหน้ากรีดยางทุก 7 วัน 3 - 4 ครั้ง จะสามารถป้องกันกำจัดโรคนี้ได้ หากฝนตกชุกติดต่อกันควรหมั่นทาสารเคมีต่อไปอีกจนกว่าโรคจะหาย
'''), //////////
  Rubber(
      title: 'โรคใบจุดก้างปลา ',
      urlImage: 'assets/11.png',
      subtitle: '(Corymespora cassiicola)',
      namerubber: '''ที่มา : กรมวิชาการเกษตร

เชื้อสาเหตุเกิดจากเชื้อรา (Corynespora cassiicola) เชื้อรานี้พบครั้งแรกบนใบยางในทวีปอัฟริกา เมื่อปี 2493

ลักษณะของเชื้อรา
         เชื้อคอรีเสนปอรามีโคนิเดียวเรียวเล็กไปสู่ส่วนยอด ผนังหนาสีน้ำตาลอ่อนขนาดของโคนิเดียแตกต่างกันไปตามสภาพแวดล้อมมีความยาวตั้งแต่ 23-257 ไมครอน กว้าง 3-18 ไมครอน มีผนังจำนวน 1-27 ตอน ปกติจะมีผนัง 2-16 ตอน เส้นใยของเชื้อรามีสีเขียวขี้ม้าขณะเมื่อยังอ่อน คล้ายคลึงลักษณะของเชื้อรา Helminthosporium และจะกลายเป็นสีน้ำตาลขณะอายุมากขึ้น ที่วุ้นอาหารเลี้ยงเชื้อรานี้จะมีสีน้ำตาลปรากฏเด่นชัด ในสภาพแวดล้อมและบนอาหารเลี้ยงเชื้อราชนิดที่เหมาะสมเชื้อราจะสร้างโคนิเดียในเวลา 3 วัน เมื่อปลูกเชื้อราบนใบยาง โคนิเดียของเชื้อราจะงอกในเวลา 3-4 ชม. และเข้าทำลายใบยางโดยแทรกเส้นใยที่งอกเข้าระหว่างเซลล์ผนังใบของเนื้อเยื่อใบพืชแล้วเจริญเติบโตไปในระหว่างเซลล์ชั้นในของเนื้อเยื่ออื่นๆ ของใบพืช จนสามารถสร้างโคนิเดียขึ้นภายในเวลา 4 วันภายหลังทำการปลูกเชื้อราโคนิเดียของเชื้อราเกิดขึ้นทั้งผิวด้านบนและผิวด้านล่างใบตรงบริเวณที่เป็นโรค แผลหนึ่งๆ สามารถสร้างโคนิเดียได้จำนวนมากถึง 1,200 สปอร์ต่อตารางเซนติเมตร และสปอร์เหล่านี้แพร่กระจายโดยอาศัยลมพัดพาไป

ลักษณะอาการ

        ได้ตรวจพบเชื้อคอรีเนสปอราบนใบยางครั้งแรกจากการศึกษาตัวอย่างบนใบยางที่เป็นโรคจุดตานกที่ได้รวบรวมไว้ จากการศึกษาในประเทศอินเดียในเวลาต่อมาพบว่าอาการของโรคที่เกิดจากเชื้อคอรีเนสปอรามีจุดแผลสองลักษณะ คือ แบบแผลกลมขนาดเส้นผ่าศูนย์กลาง 1-8 มม. และอีกแบบมีลักษณะแผลเป็นรูปร่างไม่แน่นอน โดยทั่วไปแบบแผลกลม อาการจะเหมือนโรคใบจุดตานก แต่โรคที่เกิดจากเชื้อราคอรีเนสปอราจะมีอาการเป็นจุดแผลขนาดใหญ่กว่า ถ้าเป็นโรคขณะใบยังอ่อนปลายใบจะไหม้เนื่องจากมีจุดแผลลุกลามติดต่อกัน สำหรับลักษณะอาการของโรคตามธรรมชาติที่พบในประเทศไทย และจากการปลูกเชื้อบนใบยางพันธุ์ rric103 และ krs21 เป็นแผลขนาดใหญ่มากนับได้หลายเซนติเมตรเริ่มแรกอาการของแผลมีเนื้อเยื่อตายแล้วอาการลุกลามออกไปตามเส้นใบทำให้เห็นเส้นใบช้ำเป็นสีน้ำตาลหรือดำลายชัดเจนเปรียบคล้ายลายก้างปลาบนเนื้อเยื่อใบตายสีเหลืองนี้และต่อมาเนื้อเยื่อบริเวณแผลนี้จะแห้งทำให้ใบร่วงในที่สุด สาเหตุที่ใบยางเป็นโรคร่วงอย่างรวดเร็วสันนิษฐานว่าเชื้อราผลิตสารเคมีบางชนิดที่ทำให้ใบร่วงโดยตรง ยางพันธุ์ที่อ่อนแอต่อโรค จะแสดงอาการกิ่งตายจากยอดร่วมด้วย ในกรณีที่เกิดโรคระบาดรุนแรงต้นยางพันธุ์อ่อนแอเหล่านี้ยืนต้นตายเป็นจำนวนมาก โรคใบจุดก้างปลาระบาดรุนแรงทั้งในสภาพอากาศแห้งแล้งและชุ่มชื้น'''), //////////
  Rubber(
      title: 'โรคใบจุดตานก',
      urlImage: 'assets/12.png',
      subtitle: '(Drechslera (Helminthosporium) heveae)',
      namerubber: '''ที่มา : กรมวิชาการเกษตร

เชื้อสาเหตุเกิดจากเชื้อรา Drechslera (Helminthosporium) heveae

ลักษณะของเชื้อรา
        มีลักษณะรูปร่างคล้ายเมล็ดข้าวเปลือก ขนาดประมาณหนึ่งในสิบของมิลลิเมตร เมื่อใช้แว่นขยายส่องดูจะเห็นสปอร์มีสีน้ำตาลไหม้ ในระยะที่เชื้อราสร้างสปอร์ขึ้นเป็นจำนวนมากคือ ระยะ 2-3 สัปดาห์ต่อจากการเริ่มเข้าทำลายของเชื้อราอาจจะมองเห็นกลุ่มของสปอร์ซึ่งอยู่รวมเป็นกระจุกมีสีน้ำตาลไหม้แวววาวที่บริเวณกลางจุดของแผลทางด้านล่างของแผ่นใบ สปอร์เหล่านี้แพร่กระจายโดยอาศัยลมพัดพาไป นอกจากนี้ ฝน น้ำค้างตลอดจนการเสียดสีระหว่างต้นยางและการที่คนไปสัมผัสขณะปฏิบัติงานช่วยทำให้เกิดการระบาดและแพร่กระจายของสปอร์ไปยังต้นข้างเคียงได้เป็นอย่างดี  โรคใบจุดตานกจะเกิดรุนแรงมากในพื้นที่ปลูกยางที่เป็นดินร่วนปนทรายซึ่งไม่อุ้มน้ำและไม่มีความสมบูรณ์

ลักษณะอาการ

        สังเกตได้เด่นชัดคือ จุดที่เกิดขึ้นมีลักษณะคล้ายคลึงกับตานก ตามปกติลักษณะของจุดค่อนข้างกลม มีขอบแผลสีน้ำตาลล้อมรอบรอยโปร่งแสงที่บริเวณกลางจุด ขนาดของจุดมักมีเส้นผ่าศูนย์กลางประมาณ 1-3 มิลลิเมตรเท่านั้น ทั้งนี้เนื่องจากรอยจุดเหล่านี้เกิดขึ้นด้วยเชื้อราสาเหตุเข้าทำลายขณะที่ใบเจริญและขยายตัวจนมีขนาดโตเต็มที่แล้วแต่ยังไม่กระด้าง นอกเหนือจากลักษณะอาการของจุดดังกล่าวมาแล้วนี้บนใบยางที่เป็นโรคใบจุดตานกมักมีลักษณะของจุดแตกต่างออกไปจากแบบอย่างของโรคดังที่กล่าวไว้แล้วอยู่บ้าง คือ ถ้าเชื้อราเข้าทำลายในระยะใบยังอ่อนมากจุดของแผลที่เกิดขึ้นจะไม่แตกต่างจากจุดที่เกิดจากการเข้าทำลายของเชื้อราชนิดอื่นๆ เลย นอกจากนี้ถูกเชื้อราสกุลคอลเลโทตริกัมทำลาย แต่ถ้าเชื้อราเข้าทำลายเมื่อใบยางอายุมากขึ้น คือ ขณะที่ผิดใบกระด้างแล้วจุดที่เกิดจากเชื้อราสาเหตุโรคใบจุดตานกนี้เข้าทำลายจะเป็นเพียงรอยที่น้ำตาลเข็มเท่านั้น เป็นที่สังเกตได้ว่าโดยทั่วๆ ไปลักษณะอาการของโรคทั้งสามแบบนี้มักจะเกิดขึ้นบนใบยางที่เป็นโรคใบจุดตานกอย่างรุนแรง

การป้องกันกำจัด

        เป็นที่ทราบกันทั่วไปว่าโรคใบจุดตานกนี้ใช้ยารักษาให้หายได้ยาก ทั้งนี้เนื่องจากสปอร์มีความต้านทานต่อยาบางชนิดสูง และเชื้อราเข้าทำลายใบยางได้อย่างรวดเร็วโดยเฉพาะอย่างยิ่งในระยะที่ใบยังอ่อน มีผิวใบเป็นไขมันซึ่งยาไม่ค่อยจับติดใบ เท่าที่ปรากฏผลการป้องกันกำจัดโรคใบจุดตานกนี้การใช้ยาประเภทคาร์บาเมท เช่น ไซเนบ มาเนบ หรือแมงโคเซบ ให้ผลการป้องกันโรคใบจุดได้ดี ทั้งนี้ยกเว้นประเภทคาร์บาเมทที่มีสารเหล็กเป็นส่วนประกอบรวมทั้งยาประเภทสารประกอบทองแดง

        คำแนะนำป้องกันรักษาโรคใบจุดนี้มุ่งหมายทางการป้องกันโรคมากกว่าการรักษาโดยแนะนำให้ฉีดยาบ่อยครั้ง แต่ละครั้งไม่ควรทิ้งระยะให้นานเกินหนึ่งสัปดาห์ เป็นที่น่าสังเกตว่า การลดจำนวนครั้งของการพ่นยาด้วยการเติมสารจับใบไม่ให้ผลดีในการป้องการเกิดโรคเนื่องจากเหตุผลที่ว่าใบยางเจริญเติบโตและขยายตัวรวดเร็วมาก ยาที่ใช้พ่นควรให้แมงโคเซบมีความเข้มข้น 0.2% และควรพ่นใบยางอ่นที่ส่วนปลายยอดของต้นระยะที่กำลังเจริญผลิใบใหม่และใบกำลังขยายตัวให้ทั่วถึง เครื่องพ่นควรเป็นเครื่องพ่นแบบสะพานหลังจะทำให้สามารถเลือกฉีดเฉพาะส่วนปลายยอดของต้นได้ ทำให้ไม่เปลืองยาที่ต้องเสียไปกับการฉีดใบแก่ที่อยู่ทางตอนล่างของต้น การพ่นยาป้องกันโรคนี้ควรทำการพ่นติดต่อกันเป็นเวลาหลายสัปดาห์จนกว่าต้นยางมีใบฉัตรใหม่ที่สมบูรณ์'''), //////////
  Rubber(
      title: 'โรคใบร่วงและฝักเน่า',
      urlImage: 'assets/13.png',
      subtitle: '(Phytophthora leaf fall and pod rot)',
      namerubber: '''ที่มา : กรมวิชาการเกษตร

เชื้อสาเหตุเกิดจากเชื้อรา Phytopthora สองชนิดคือ palmivora และ botryose
ลักษณะของเชื้อรา
        ลักษณะของเชื้อรานี้แพร่กระจายโดยอาศัยน้ำพัดพาสปอร์ไป สำหรับการเข้าทำลายเนื้อเยื่อส่วนต่างๆ ของต้นยางในสภาพธรรมชาติ และลำต้นตอนการเกิดโรคระบาดที่เกิดจากเชื้อรานี้ จะเข้าทำลายที่ส่วนฝัก ยอด ก้าน ใบ และแผ่นใบด้านล่างทางรูใบเท่านั้น ส่วนการระบาดฝักจะถูกเชื้อเข้าทำลายก่อนแล้วแพร่พันธุ์เป็นจำนวนมากอย่างรวดเร็ว จากนั้นเชื้อจะเข้าทำลายส่วนก้านใบทำให้ใบร่วง ในกรณีที่ต้นยางอ่อนยังไม่มีฝัก บริเวณยอดอ่อนจะถูกเชื้อราเข้าทำลายก่อนทำให้ยอดเน่า ต่อมาเชื้อจะลุกลามเข้าทำลายก้านใบและแผ่นใบในที่สุด สภาพอากาศที่เหมาะสมต่อการเกิดโรคระบาดอย่างรุนแรงนั้น ขึ้นอยู่กับปริมาณน้ำฝนและจำนวนวันฝนตกเป็นปัจจัยสำคัญ โดยปกติโรคจะเกิดขึ้นอย่างกว้างขวางและรุนแรงในระยะที่มีฝนตกหนักติดต่อกันเป็นเวลาหลายๆวันในบริเวณที่ที่มีเชื้อราชนิดนี้ระบาดอยู่ซึ่งมักจะเกิดขึ้นในระหว่างเดือนมิถุนายนถึงพฤศจิกายนของทุกๆป

ลักษณะอาการ

        อาการของโรคที่ส่วนต่างๆ ของต้นยางซึ่งถูกเชื้อราชนิดนี้เข้าทำลายมีดังต่อไปนี้ คืออาการที่ฝัก ฝักที่ถูกทำลายจะเน่า ดำ ค้างอยู่บันต้นไม่แตกและร่วงหล่นตามธรรมชาติ สำหรับอาการของโรคใบร่วง ใบยางจะร่วงทั้งที่มีสีเขียวสดและสีเหลือง ทั้งนี้ขึ้นอยู่กับสภาพอากาศโดยมีลักษณะที่ปรากฏเด่นชัด คือ มีรอยช้ำสีดำอยู่ที่บริเวณก้านใบ และที่จุดกึ่งกลางของรอยช้ำมีหยดน้ำยางเกาะติดอยู่ด้วยใบยางร่วงที่เกิดจากเชื้อรานี้เมื่อนำขึ้นมาสบัดไปมาเพียงเบาๆ ใบย่อยจะหลุดทันที ซึ่งต่างกับใบยางที่ร่วงหล่นตามธรรมชาติ คือเมื่อนำใบยางที่ร่วงตามธรรมชาติมาสบัดใบย่อยจะไม่หลุดออกจากก้านใบแผ่นใบบางครั้งจะเป็นแผลที่มีลักษณะช้ำฉ่ำน้ำ ขนาดของแผลไม่แน่นอน สำหรับต้นยางอ่อนถ้าหากถูกเชื้อเข้าทำลาย จะเกิดอาการยอดเน่าแล้วลุกลามไปทำลายก้านใบและแผ่นใบ ทำให้ต้นยางตายได้ ซึ่งโรคนี้จะระบาดบริเวณพื้นที่ปลูกยางที่มีฝนตกชุก ความชื้นสูง จะระบาดมากในบริเวณภาคใต้ฝั่งตะวันตก คือ จ.ระนอง พังงา กระบี่ ตรัง ภูเก็ต และสตูล ส่วนภาคใต้ฝั่งตะวันออก คือ ชุมพร สุราษฎร์ธานี นครศรีธรรมราช สงขลา และพัทลุง การเกิดโรคใบร่วงจะไม่รุนแรงเท่าฝั่งตะวันตก ทางฝั่งตะวันตก โรคจะระบาดในช่วงเดือนมิถุนายน-สิงหาคม ส่วนภาคใต้ฝั่งตะวันออก จะเริ่มการระบาดของโรคในช่วงเดือนตุลาคม-ธันวาคม สำหรับโรคที่หน้ากรีดยางโดยมีเชื้อราชนิดเดียวกันนี้เป็นสาเหตุ เรียกว่าโรคเส้นดำซึ่งจะกล่าวต่อไป

การป้องกันกำจัด

        โรคใบร่วงของยางพาราที่เกิดจากเชื้อราชนิดนี้ เราสามารถทำการป้องกันและรักษาได้โดยใช้ยาฆ่าเชื้อราบางประเภท เช่น สารประกอบทองแดงผสมน้ำมันบางชนิดฉีดป้องกันก่อนถึงฤดูกาลของโรคระบาด อย่างไรก็ดีการปฏิบัติเพื่อป้องกันรักษาโรคโดยวิธีดังกล่าวในสวนยางที่มีต้นยางขนาดใหญ่มีอุปสรรคหลายประการ โดยเฉพาะอย่างยิ่งเกี่ยวกับเครื่องพ่นยาและนอกจากนี้ผลประโยชน์ที่ได้รับจากการพ่นยาป้องกันรักษาโรคในสภาพปัจจุบันไม่คุ้มกับค่าใช้จ่ายที่เสียไป ทั้งนี้เพราะต้นยางที่มีขนาดใหญ่ที่แสดงอาการใบร่วงนี้ไม่ได้รับอันตรายจนถึงกับทำให้ต้นยางตายได้ เพียงแต่ปริมาณน้ำยางหรือผลผลิตที่ได้ลดลงเท่านั้น จึงไม่แนะนำให้ชาวสวนยางทำการพ่นยารักษาโรคในสวนยางขนาดใหญ่ แต่ขอแนะนำให้เจ้าของสวนยางที่มีต้นยางอายุน้อยกว่า 2 ปี ทำการฉีดป้องกันรักษาโรคเพื่อมิให้ต้นยางเน่าตายเนื่องจากการเป็นโรค โดยใช้ยา ไดโฟลาแทน 80 ผสมน้ำมีอัตราส่วน ยา 2 กรัมต่อน้ำ 1 ลิตรฉีดพุ่มใบเพื่อป้องกันโรคทุกๆ สัปดาห์ ระหว่างที่เกิดโรคระบาดในท้องที่นั้นๆ สำหรับต้นยางขนาดใหญ่ที่เกิดโรคใบร่วงอย่างรุนแรงจนใบร่วงหมดต้น ให้เจ้าของสวนเร่งการเจริญเติบโตของต้นยางต่อไป'''), //////////
//////////
  Rubber(
      title: 'โรคราแป้ง',
      urlImage: 'assets/14.png',
      subtitle: '(Oidium Leaf Disease)',
      namerubber: '''ที่มา : กรมวิชาการเกษตร

เชื้อสาเหตุ            เกิดจากเชื้อรา Oidium heveae Steinm ( Oidium Leaf Disease)

ลักษณะของเชื้อรา

        ลักษณะของเชื้อราสกุลออยเดี้ยมทั่วไปจะมองด้วยตาเปล่าเห็นเป็นกระจุกของเส้นใยสีขาวถ้าส่องดูด้วยแว่นขยายจะเห็นมีสปอร์ติดกันเป็นลูกโซ่อยู่ปลายเส้นใย เมื่อกลุ่มของเชื้อราเจริญได้ดีบนใบจะมองเห็นเป็นรอยของราแป้งเป็นหย่อมๆทั่วไป เชื่อสกุลออยเดี้ยมที่พบทำลายใบและดอกยางเป็นชนิด Oidium heveae ซึ่งเจริญเติบโตได้บนเนื้อเยื่อของพืชที่มีชีวิตเท่านั้นเช่นเดียวกับเชื้อชนิดอื่นๆ ของสกุลนี้ เท่าที่ทราบในปัจจุบันปรากฏว่าเชื้อรานี้อยู่ข้ามปีได้ โดยอาศัยบนใบยางที่อยู่กิ่งล่างๆ หรือบนใบยางของต้นกล้าเล็กๆ ที่งอกในสวนยาง และยังไม่พบว่าเชื้อรานี้สร้างสปอร์ชนิดอื่นๆเพื่ออยู่ข้ามฤดูกาล

ลักษณะอาการ

         แผลขนาดไม่แน่นอน ใบอ่อน ปลายใบะบิดงอ เน่า มีสีดำ ร่วงหล่นจากต้น ใบเพสลาด แผลเป็นจุดที่คอนข้างใหญ่ และมีขอบเขตไม่แน่นอนแผลจะเห็นปุยเส้นใยสีขาว เทา บนด้านล่างของแผ่นใบ ใบแก่แผลจะเป็นรอยสีเหลืองซีด เฉพาะบริเวณที่เชื้อราเข้าทำลายและแผลจะกายเป็นสีน้ำตาล

         โรคพืชหลายชนิดที่เกิดจากเชื้อราออยเดี้ยมเป็นสาเหตุมีลักษณะอาการเด่นชัดของราแป้งคล้ายคลึงกันหมด ซึ่งมองเห็นเป็นปุยของกลุ่มสปอร์และเส้นใยสีขาว-เทาที่เชื้อราสร้างขึ้นบนผิวใบ สำหรับใบยางพาราปุยสีขาวมักจะปรากฏบนด้านล่างของแผ่นใบ ใบยางที่ถูกเชื้อราเข้าทำลายขณะมีอายุน้อยมากจะหลุดร่วงไป แต่ถ้าใบแข็งแรงขึ้นคือระยะเป็นสีทองแดงถึงสีเขียวใบระยะนี้ได้เจริญเติบโตผ่านระยะใบร่วงที่เกิดจากการทำลายของเชื้อรานี้แล้วเมื่อใบเจริญต่อไปแผลจะเป็นรอยสีเหลืองซีดเฉพาะบริเวณที่มีเชื้อราทำลายอยู่ ซึ่งต่อไปจะกลายเป็นรอยไหม้สีน้ำตาลรูปร่างไม่แน่นอนตามขนาดและขอบเขตของบริเวณที่เป็นส่วนที่เชื่อราเจริญอยู่ก่อน

         เชื้อราเข้าทำลายใบโดยการที่สปอร์งอกแล้วไซทะลุผิวใบเข้าไปในเนื้อเยื่อใบ ใบร่วงเนื่องจากเชื้อออยเดี้ยมส่วนมากมีขนาดเล็กยาวประมาณ 2 นิ้ว และยังไม่คลี่ขยายตัว ใบร่วงที่หล่นอยู่ บนพื้นนี้มีลักษณะปลายใบบิดงอ เน่า มีสีดำจากปลายใบเข้ามา และส่วนมากเป็นใบย่อยเนื่องจากก้านใบยังติดอยู่ที่กิ่งก้านบนต้น
ลักษณะอาการของจุดที่เกิดจากเชื้อออยเดี้ยมที่เกิดขึ้นบนใบที่เข็งแรงแล้วต่างจากจุดที่เกิดจากเชื้อกลีโอสปอเรี่ยม คือ จุดที่เกิดจากเชื้อกลีโอสปอเรี่ยมจะเป็นจุดนูนกลมๆ ส่วนจุดที่เกิดจากเชื้ออยเดี้ยมจะเป็นรอยแผลที่ค่อนข้างใหญ่และมีขอบเขตไม่แน่นอน
'''), //////////
  Rubber(
      title: ' โรครากแดง',
      urlImage: 'assets/15.png',
      subtitle: '(Red root disease)',
      namerubber: ''' ที่มา : กรมวิชาการเกษตร

เชื้อสาเหตุ         เชื้อรา Gonoderma pseudojerreum

ลักษณะอาการ

        เส้นใยของเชื้อราสาเหตุของโรคนี้จะมีสีแดง และเป็นมันปกคลุมผิวรากของยางที่ เป็นโรค หากเชื้อราอยู่ในระยะเจริญเส้นใยจะมีสีขาวครีม เมื่อแก่ขึ้นจะกลายเป็นสีแดง รากยางที่ เป็นโรคนี้ในระยะแรกจะมีสีน้ำตาลซีด และแข็ง ต่อมาเปลี่ยนเป็นสีเนื้ออ่อน เนื้อไม้ที่เป็นโรคจะพรุน อาจเปียกหรือแห้งแล้วแต่สภาพของดิน เนื้อเยื่อแต่ละวงจะหลุดลุ่ยแยกออกจากกันได้ง่าย ดอกเห็ดจะเป็นวงแข็ง ผิวด้านบนเป็นรอยย่นสีน้ำตาลแดงเข้ม ผิวด้านล่างเป็นสีขาวขี้เถ้า รอบ ๆ ของดอกเห็ดมีสีขาวครีม

การป้องกันกำจัด

        1. การเตรียมพื้นที่ปลูกยาง จะต้องทำการถอนราก และเผาทำลายตอไม้ ท่อนไม้ เพื่อทำลายเชื้อราอันอาจทำให้เกิดโรครากได้
        2. หมั่นตรวจตราหาดูต้นที่เป็นโรค โดยการขุดโคนดูรากหลังจากปลูกยางไปแล้วประมาณ 1 ปี หากไม่พบต้นที่เป็นโรคให้ทาสารเคมีพีซีเอ็นบี (PCNB) 20% เคลือบไว้ที่โคนต้นตรงคอดิน รากแก้ว และฐานของรากแขนง
        3. หากพบต้นที่เป็นโรค ที่โคนต้น โคนราก และรากแขนงให้ตัด หรือเฉือนทิ้ง แล้วทาด้วยสารเคมี PCNB 20% ผสมน้ำ และควรทำการตรวจซ้ำในเวลา 12 เดือนต่อมา
        4. ถ้าพบโรคในต้นยางอายุน้อยให้ทำการขุดรากที่เป็นโรคขึ้นมาเผาทำลาย'''), //////////
  Rubber(
      title: 'โรครากขาว',
      urlImage: 'assets/16.png',
      subtitle: '',
      namerubber: '''ที่มา : กรมวิชาการเกษตร

เชื้อสาเหตุเกิดจากเชื้อราสาเหตุโรครากขาวจะแตกสาขาเป็นร่างแหจับติดแน่นและแผ่คลุมทั่วผิวรากที่เป็นโรค

ลักษณะของเชื้อรา เส้นใยจะมีสีขาวและปลายแบน

ลักษณะอาการ
        เส้นใยของเชื้อราจะเป็นสีขาว แตกกิ่งก้านแผ่ปกคลุมทั่วผิวราก เส้นใยที่อายุมากจะกลมนูนและกลายเป็นสีเหลืองซีด หรือแดงซีด เนื้อไม้ในระยะแรกจะแข็งกระด้างเป็นสีน้ำตาลซีด ในระยะที่เป็นโรคอย่างรุนแรงจะเป็นสีครีม ถ้าอยู่ในที่ชื้นแฉะจะเน่า และดอกเห็ดมีลักษณะเป็นแผ่นครึ่งวงกลม แผ่นเดียวหรือซ้อนกันหลายแผ่นเป็นชั้น ๆ เกาะติดกับโคนต้นหรือรากเหมือนหิ้ง ผิวด้านบนของดอกเห็ดเป็นสีเหลืองส้ม เป็นวงสลับสีอ่อนแก่ ขอบดอกเป็นสีขาว ด้านล่างเป็นสีส้มแดงและเป็นรูเล็ก ๆ

การป้องกันกำจัด

        เป็นเรื่องค่อนข้างยุ่งยากและเสียค่าใช้จ่ายสูง ถ้ามีต้นตายหรือเป็นโรคอย่างรุนแรง คือมีอาการใบเหลืองทั้งต้นแล้วควรขุดรากถอนโคนและเผาทำลายเสีย แล้วป้องกันและรักษาต้นข้างเคียงไม่ให้เป็นโรค โดยใช้สารเคมี ซึ่งการป้องกันและรักษาโรครากให้ได้ผลจะต้องทำควบคู่กันไป ทั้งด้านเขตกรรมและการใช้สารเคมี คือ
        1. ปลูกยางในพื้นที่ปลอดโรค ควรเตรียมพื้นที่ปลูกยางให้ปลอดโรค โดยการขุดทำลายตอยางเก่า เพื่อกำจัดแหล่งโรค
        2.หลังเตรียมดินควรปลูกพืชคลุมเพื่อปรับสภาพดินให้เหมาะกับการเจริญเติบโตของพืชและจุลินทรีย์บางชนิดที่เป็นพิษ กับเชื้อราสาเหตุของโรค ในพื้นที่ที่เป็นโรครากอย่างรุนแรง ควรปลูกพืชอื่นอย่างน้อย 1-2 ปี เพื่อลดการระบาดของโรค และพืชที่ปลูกไม่ควรเป็นพืชอาศัยของโรคราก
        3. ขุดคูล้อมหรือกั้นระหว่างต้นเป็นโรคกับต้นไม่เป็นโรค เพื่อป้องกันการสัมผัสกันของราก
        4. ใช้สารเคมีโรครากขาว- กำมะถันผง อัตรา 150 กรัม/ต้น ใส่ในหลุมก่อนปลูกยาง เพื่อลด pH ของดินทำให้ไม่เหมาะต่อการเจริญของเชื้อราสาเหตุ ถ้าในพื้นที่ที่เป็นโรคอย่างรุนแรง ควรใช้อัตรา 250 กรัม/หลุมปลูก- ป้องกันรักษาต้นข้างเคียงที่ยังไม่เป็นโรค หรือเป็นโรคเพียงเล็กน้อย ด้วยสารเคมีไตรเดอมอร์ฟ หรือไซโปรโคนาโซล อัตรา 10-20 มิลลิลิตร/น้ำ 2 ลิตร/ต้น หรือใช้เฟนพิโคลนิล อัตรา 4-8 กรัม/น้ำ 3 ลิตร/ต้น 6 เดือน/ครั้ง โดยเทราดรอบโคนต้นที่เซาะเป็นร่องเล็ก ๆ กว้าง 10-15 ซม. ปล่อยให้สารเคมีค่อย ๆ ซึมไปตามราก- ส่วนโรครากแดงและรากน้ำตาล ใช้ไตรเดอมอร์ฟ หรือไดฟีโนโคนาโซล (สกอร์) อัตรา 20-30 มิลลิลิตร/น้ำ 2-3 ลิตร/ต้น ทุก ๆ 6 เดือน เทราดรอบโคนต้นเช่นเดียวกับโรครากขาว'''), //////////

  Rubber(
      title: 'โรคราสีชมพู',
      urlImage: 'assets/17.png',
      subtitle: '(Pink Disease)',
      namerubber: '''ที่มา : กรมวิชาการเกษตร

เชื้อสาเหตุเชื้อรา Corticium salmonicolor

ลักษณะอาการ
        บริเวณกิ่งหรือคาคบ อาการขั้นแรกที่เชื้อราเข้าทำลายเห็นเป็นรอย น้ำยางถูกขับไหลออกมาเป็นทางยาวใต้รอยแผล เมื่อน้ำยางแห้งจะมีราดำเข้าจับ เวลาอากาศชุ่มชื้นเชื้อราจะเจริญเติบโตเต็มที่และเปลี่ยนเป็นสีชมพู มีรอยแตกระแหงเล็ก ๆ กระจายทั่วไป ส่วนของต้นยางเหนือส่วนที่เป็นโรคจะแห้งตายไป มีกิ่งอ่อนแตกเจริญขึ้นมาใหม่จากส่วนใต้รอยแผล่

สภาพแวดล้อมที่เหมาะสมต่อการเกิดโรค อากาศมีความชุ่มชื้น

การป้องกันกำจัด
        1. ดูแลรักษาสวนยางให้มีอากาศถ่ายเทได้สะดวกไม่อับชื้น
        2. เมื่อพบต้นที่เป็นโรค ให้รีบตัดส่วนที่เป็นโรคทิ้งและทำลายเสีย
        3. สำหรับต้นยางที่ยังไม่เปิดกรีด หากพบโรคนี้ให้ใช้บอร์โดมิกซ์เจอร์ ซึ่งมีอัตราส่วนของจุนสี 120 กรัม ปูนขาว 240 กรัม (ถ้าเป็นปูนเผาใหม่ใช้ประมาณ 150 กรัม) ผสมน้ำ 10 ลิตร ทา
       4. สำหรับยางที่เปิดกรีดแล้ว หากเป็นโรคนี้ ให้ใช้สารเคมีไตรเดม้อฟ (Tridemorph) ฉีดพ่นหรือทาบริเวณที่เป็นโรคโดยขูดส่วนที่เป็นโรคก่อนฉีดหรือทา'''),
  Rubber(
      title: 'โรคใบร่วงและผลเน่าที่เกิดจากเชื้อไฟท้อปโทร่า',
      urlImage: 'assets/18.png',
      subtitle: '(Phytophthora Leaf Fall)',
      namerubber: '''ที่มา : กรมวิชาการเกษตร

เชื้อสาเหตุ         เชื้อรา Phytophthora palmivora และ Phytophthora botryosa

ลักษณะอาการ

        ใบยางจะร่วงทั้งที่มีสีเขียวสดหรือสีเหลือง ทั้งนี้ขึ้นอยู่กับสภาพอากาศ โดยมีลักษณะเด่นที่สามารถสังเกตเห็นได้อย่างชัดเจน คือ มีรอยช้ำสีดำตรงบริเวณก้านใบ และที่จุด กึ่งกลางของรอยช้ำจะมีหยดน้ำยางสีขาวเกาะติดอยู่ เมื่อนำใบยางที่ร่วงขึ้นมาสลัดเบา ๆ ใบย่อย จะหลุดทันที ซึ่งต่างกับใบยางที่ร่วงหล่นตามธรรมชาติ
        ต้นยางที่เกิดโรคใบร่วงนี้แล้ว จะไม่ผลิใบยางออกมาใหม่ในปีนั้น ๆ (ซึ่งเป็นลักษณะอาการที่แตกต่างจากต้นยางที่เป็นโรคใบร่วงซึ่งเกิดจากสาเหตุอื่น) จะผลิใบใหม่ตามปกติเมื่อถึงฤดูผลิใบของปีถัดไป ยกเว้นต้นยางที่เป็นโรคใบร่วงจนหมดต้น ซึ่งจะผลิใบใหม่ขึ้นมาทดแทนเพียงเล็กน้อย ประมาณ 5% ของพุ่มใบปกติเท่านั้น ช่วงยางผลิใบใหม่

สภาพแวดล้อมที่เหมาะสมต่อการเกิดโรค

        ความชื้น ปริมาณน้ำฝน และจำนวนวันฝนตก เป็นปัจจัยที่สำคัญที่จะสนับสนุนให้เชื้อรานี้ระบาดรุนแรงขึ้น โดยปกติจะพบโรคนี้ระบาดระหว่างเดือนมิถุนายนถึงเดือนพฤศจิกายน

การแพร่ระบาด
        แพร่โดยน้ำ พัดพาสปอร์ของเชื้อราไป เชื้อจะเข้าทำลายส่วนที่เป็นผล ยอด ก้านใบ และแผ่นใบทางด้านรูใบตามลำดับ ในกรณีที่เป็นยางอ่อนยังไม่ให้ผล เชื้อราจะเข้าทำลายยอดอ่อนก่อน แล้วจึงลุกลามไปยังก้านใบ และแผ่นใบในที่สุด โรคใบร่วงจะระบาดเป็นประจำในท้องที่ต่อไปนี้ ภาคใต้ฝั่งตะวันตก ได้แก่ จังหวัดระนอง พังงา ภูเก็ต กระบี่ ตรัง และ สตูล

การป้องกันกำจัด

        1. วิธีป้องกันที่ดีวิธีหนึ่ง คือ ใช้พันธุ์ต้านทานต่อโรคปลูกในแหล่งที่มีโรคนี้ระบาดเป็นประจำ พันธุ์ที่ต้านทานโรคได้ดีคือ พันธุ์ GT1 ในกรณีที่ปลูกพันธุ์อื่นที่อ่อนแอต่อโรคไปแล้ว ก็อาจใช้พันธุ์ GT1 นี้ติดตาเปลี่ยนยอดได้
        2. ในยางเล็กที่มีอายุไม่เกินสองปี ใช้สารเคมีแคปตาโฟล 80 % ในอัตรา 2 กรัม ต่อน้ำ 1 ลิตร ฉีดพ่นพุ่มใบทุกสัปดาห์เพื่อป้องกันโรคในช่วงที่มีโรคนี้ระบาด
        3. ในยางใหญ่การป้องกันรักษาจะไม่คุ้มกับค่าใช้จ่ายที่เสียไปประกอบกับยางใหญ่ ถึงแม้จะเป็นโรคใบร่วงต้นยางก็ไม่ตาย เพียงแต่ปริมาณน้ำยางลดลงเท่านั้น วิธีแก้ไขยางใหญ่ที่เป็นโรคคือ ใส่ปุ๋ยบำรุงดินให้มีความอุดมสมบูรณ์เพิ่มขึ้น เพื่อเร่งการเจริญเติบโตของต้นยาง ถ้ายางเปิดกรีดแล้วจำเป็นต้องใช้ยากำจัดเชื้อรา ทาบริเวณรอยกรีดอย่างสม่ำเสมอ เพื่อป้องกันการเกิดโรคหน้ากรีด โดยเฉพาะอย่างยิ่งโรคเส้นดำ'''),
  Rubber(
      title: 'โรคใบที่เกิดจากเชื้อออยเดียม',
      urlImage: 'assets/19.png',
      subtitle: '(Oidium Leaf Disease)',
      namerubber: ''' ที่มา : กรมวิชาการเกษตร

เชื้อสาเหต            เชื้อรา Oidium heveae

ลักษณะอาการ

        จะมองเห็นปุยของกลุ่มสปอร์ และเส้นใยสีขาวเทาของเชื้อราที่สร้างขึ้นบนผิวด้านล่างของแผ่นใบ มองดูคล้ายแป้งถ้าเกิดกับใบยางอายุน้อยก็จะร่วงหลุดไป แต่ถ้าใบแข็งแรงแล้ว ก็เจริญเติบโตต่อไปได้ แต่รอยแผลจะเป็นสีเหลืองซีด แล้วเปลี่ยนเป็นสีน้ำตาลขนาดและรูปร่างของแผลไม่แน่นอน ถ้าโรคนี้ทำลายมากๆ ใบย่อยจะร่วงเหลือแต่ก้านใบติดอยู่ ใบที่ร่วงส่วนมากมีขนาดเล็ก ยาวประมาณ 2 นิ้วและยังไม่คลี่ขยายตัว ใบที่หล่นอยู่บนพื้นดินจะมีลักษณะปลายใบบิดงอเน่า มีสีดำจากปลายใบเข้ามา เชื้อนี้นอกจากทำให้เกิดโรคใบร่วง และใบจุดแล้ว ยังทำให้ดอกยางร่วงด้วย โรคนี้มีระบาดในช่วงระยะแรกของฤดูยางผลิใบใหม่ ซึ่งจะมีผลทำให้พุ่มใบของต้นยางในปีนั้น ๆ เสียหาย

การป้องกันกำจัด

        1. ทำความสะอาดสวนยาง โดยเก็บกวาดใบที่ร่วงเผาไฟให้หมด
         2. ฉีดพ่นต้นยางด้วยสารเคมี กำมะถันผง ในอัตรา 1.5 - 4 กิโลกรัมต่อพื้นที่ 1 ไร่ (แล้วแต่ขนาดของต้นยาง) ทุกๆ 5 - 7 วัน ประมาณ 5 - 6 ครั้ง ในระยะที่ใบอ่อนเริ่มผลิ
         3. ใส่ปุ๋ยเพื่อให้ต้นยางแข็งแรง ในระยะที่ต้นยางกำลังจะผลิใบใหม่''')
];
